Series

In [6]:
import pandas as pd

#Create a Series in pandas 
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

#Accessing one element from dataframe
s['b']

-5

Data Frame

In [7]:
#Create two daimentional dataframe using pandas 
data = {   'Country': ['Belgium', 'India', 'Brazil'], 
           'Capital': ['Brussels', 'New Delhi', 'Brasília'],
           'Population': [11190846, 1303171035, 207847528]
       }
    
#Convert dataframe into tabuler format
df = pd.DataFrame(data)

#Get Subset of data element 
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [8]:
#Select single value by raw and column (ByPosition)
df.iloc[[0], [0]]

   Country
0  Belgium

In [9]:
#Select single value by row &column labels (ByLable)
df.loc[[0], ['Country']]

   Country
0  Belgium

In [10]:
#Select single row of subset of rows(By Lable/Position)
df.loc[[2]]

  Country   Capital  Population
2  Brazil  Brasília   207847528